v2_5_1/extras/Test.jmx
<jmeterTestPlan version="1.2" properties="1.8">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test" enabled="true">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <stringProp name="TestPlan.comments">Sample test for demonstrating JMeter Ant build script and Schematic stylesheet</stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <longProp name="ThreadGroup.start_time">1143889321000</longProp>
        <stringProp name="ThreadGroup.num_threads">3</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <stringProp name="LoopController.loops">5</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <longProp name="ThreadGroup.end_time">1143889321000</longProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      </ThreadGroup>
      <hashTree>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Counter" enabled="true">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.incr">1000</stringProp>
          <stringProp name="CounterConfig.name">C</stringProp>
          <boolProp name="CounterConfig.per_user">false</boolProp>
          <stringProp name="CounterConfig.end">1000000</stringProp>
        </CounterConfig>
        <hashTree/>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Sample 1" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="Sleep_Time" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">100</stringProp>
                <stringProp name="Argument.name">Sleep_Time</stringProp>
              </elementProp>
              <elementProp name="Sleep_Mask" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">0xFF</stringProp>
                <stringProp name="Argument.name">Sleep_Mask</stringProp>
              </elementProp>
              <elementProp name="Label" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.name">Label</stringProp>
              </elementProp>
              <elementProp name="ResponseCode" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">200</stringProp>
                <stringProp name="Argument.name">ResponseCode</stringProp>
              </elementProp>
              <elementProp name="ResponseMessage" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">OK</stringProp>
                <stringProp name="Argument.name">ResponseMessage</stringProp>
              </elementProp>
              <elementProp name="Status" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">OK</stringProp>
                <stringProp name="Argument.name">Status</stringProp>
              </elementProp>
              <elementProp name="SamplerData" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">Request</stringProp>
                <stringProp name="Argument.name">SamplerData</stringProp>
              </elementProp>
              <elementProp name="ResultData" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">Response C=${C}</stringProp>
                <stringProp name="Argument.name">ResultData</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">org.apache.jmeter.protocol.java.test.JavaTest</stringProp>
        </JavaSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="51">3</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <intProp name="Assertion.test_type">6</intProp>
            <stringProp name="Assertion.assume_success">false</stringProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Sample 2" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="Sleep_Time" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">100</stringProp>
                <stringProp name="Argument.name">Sleep_Time</stringProp>
              </elementProp>
              <elementProp name="Sleep_Mask" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">0xFF</stringProp>
                <stringProp name="Argument.name">Sleep_Mask</stringProp>
              </elementProp>
              <elementProp name="Label" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.name">Label</stringProp>
              </elementProp>
              <elementProp name="ResponseCode" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">200</stringProp>
                <stringProp name="Argument.name">ResponseCode</stringProp>
              </elementProp>
              <elementProp name="ResponseMessage" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">OK</stringProp>
                <stringProp name="Argument.name">ResponseMessage</stringProp>
              </elementProp>
              <elementProp name="Status" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">OK</stringProp>
                <stringProp name="Argument.name">Status</stringProp>
              </elementProp>
              <elementProp name="SamplerData" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">Request</stringProp>
                <stringProp name="Argument.name">SamplerData</stringProp>
              </elementProp>
              <elementProp name="ResultData" elementType="Argument">
                <stringProp name="Argument.metadata">=</stringProp>
                <stringProp name="Argument.value">Response C=${C} Tn=${__threadNum}</stringProp>
                <stringProp name="Argument.name">ResultData</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">org.apache.jmeter.protocol.java.test.JavaTest</stringProp>
        </JavaSampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>